YoLuKy/InformaticaIndustrial/PruebaMotor.X/codigos/pic16f15376_copia.inc
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 01EC5h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0006h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0006h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 003Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h
SSP1CLKPPS_SSP1CLKPPS5_POSN              equ 0005h
SSP1CLKPPS_SSP1CLKPPS5_POSITION          equ 0005h
SSP1CLKPPS_SSP1CLKPPS5_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS5_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS5_MASK              equ 0020h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 01EC6h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0006h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0006h
SSP1DATPPS_SSP1DATPPS_MASK               equ 003Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h
SSP1DATPPS_SSP1DATPPS5_POSN              equ 0005h
SSP1DATPPS_SSP1DATPPS5_POSITION          equ 0005h
SSP1DATPPS_SSP1DATPPS5_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS5_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS5_MASK              equ 0020h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 01EC7h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0006h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0006h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 003Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h
SSP1SSPPS_SSP1SSPPS5_POSN                equ 0005h
SSP1SSPPS_SSP1SSPPS5_POSITION            equ 0005h
SSP1SSPPS_SSP1SSPPS5_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS5_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS5_MASK                equ 0020h

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 01EC8h
// bitfield definitions
SSP2CLKPPS_SSP2CLKPPS_POSN               equ 0000h
SSP2CLKPPS_SSP2CLKPPS_POSITION           equ 0000h
SSP2CLKPPS_SSP2CLKPPS_SIZE               equ 0006h
SSP2CLKPPS_SSP2CLKPPS_LENGTH             equ 0006h
SSP2CLKPPS_SSP2CLKPPS_MASK               equ 003Fh
SSP2CLKPPS_SSP2CLKPPS0_POSN              equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_POSITION          equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_MASK              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSN              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSITION          equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_MASK              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSN              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSITION          equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_MASK              equ 0004h
SSP2CLKPPS_SSP2CLKPPS3_POSN              equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_POSITION          equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_MASK              equ 0008h
SSP2CLKPPS_SSP2CLKPPS4_POSN              equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_POSITION          equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_MASK              equ 0010h
SSP2CLKPPS_SSP2CLKPPS5_POSN              equ 0005h
SSP2CLKPPS_SSP2CLKPPS5_POSITION          equ 0005h
SSP2CLKPPS_SSP2CLKPPS5_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS5_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS5_MASK              equ 0020h

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 01EC9h
// bitfield definitions
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0006h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0006h
SSP2DATPPS_SSP2DATPPS_MASK               equ 003Fh
SSP2DATPPS_SSP2DATPPS0_POSN              equ 0000h
SSP2DATPPS_SSP2DATPPS0_POSITION          equ 0000h
SSP2DATPPS_SSP2DATPPS0_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS0_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS0_MASK              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSN              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSITION          equ 0001h
SSP2DATPPS_SSP2DATPPS1_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS1_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS1_MASK              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSN              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSITION          equ 0002h
SSP2DATPPS_SSP2DATPPS2_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS2_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS2_MASK              equ 0004h
SSP2DATPPS_SSP2DATPPS3_POSN              equ 0003h
SSP2DATPPS_SSP2DATPPS3_POSITION          equ 0003h
SSP2DATPPS_SSP2DATPPS3_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS3_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS3_MASK              equ 0008h
SSP2DATPPS_SSP2DATPPS4_POSN              equ 0004h
SSP2DATPPS_SSP2DATPPS4_POSITION          equ 0004h
SSP2DATPPS_SSP2DATPPS4_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS4_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS4_MASK              equ 0010h
SSP2DATPPS_SSP2DATPPS5_POSN              equ 0005h
SSP2DATPPS_SSP2DATPPS5_POSITION          equ 0005h
SSP2DATPPS_SSP2DATPPS5_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS5_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS5_MASK              equ 0020h

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 01ECAh
// bitfield definitions
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0006h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0006h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 003Fh
SSP2SSPPS_SSP2SSPPS0_POSN                equ 0000h
SSP2SSPPS_SSP2SSPPS0_POSITION            equ 0000h
SSP2SSPPS_SSP2SSPPS0_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS0_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS0_MASK                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSN                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSITION            equ 0001h
SSP2SSPPS_SSP2SSPPS1_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS1_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS1_MASK                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSN                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSITION            equ 0002h
SSP2SSPPS_SSP2SSPPS2_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS2_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS2_MASK                equ 0004h
SSP2SSPPS_SSP2SSPPS3_POSN                equ 0003h
SSP2SSPPS_SSP2SSPPS3_POSITION            equ 0003h
SSP2SSPPS_SSP2SSPPS3_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS3_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS3_MASK                equ 0008h
SSP2SSPPS_SSP2SSPPS4_POSN                equ 0004h
SSP2SSPPS_SSP2SSPPS4_POSITION            equ 0004h
SSP2SSPPS_SSP2SSPPS4_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS4_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS4_MASK                equ 0010h
SSP2SSPPS_SSP2SSPPS5_POSN                equ 0005h
SSP2SSPPS_SSP2SSPPS5_POSITION            equ 0005h
SSP2SSPPS_SSP2SSPPS5_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS5_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS5_MASK                equ 0020h

// Register: RX1DTPPS
#define RX1DTPPS RX1DTPPS
RX1DTPPS                                 equ 01ECBh
// bitfield definitions
RX1DTPPS_RX1DTPPS_POSN                   equ 0000h
RX1DTPPS_RX1DTPPS_POSITION               equ 0000h
RX1DTPPS_RX1DTPPS_SIZE                   equ 0006h
RX1DTPPS_RX1DTPPS_LENGTH                 equ 0006h
RX1DTPPS_RX1DTPPS_MASK                   equ 003Fh
RX1DTPPS_RX1DTPPS0_POSN                  equ 0000h
RX1DTPPS_RX1DTPPS0_POSITION              equ 0000h
RX1DTPPS_RX1DTPPS0_SIZE                  equ 0001h
RX1DTPPS_RX1DTPPS0_LENGTH                equ 0001h
RX1DTPPS_RX1DTPPS0_MASK                  equ 0001h
RX1DTPPS_RX1DTPPS1_POSN                  equ 0001h
RX1DTPPS_RX1DTPPS1_POSITION              equ 0001h
RX1DTPPS_RX1DTPPS1_SIZE                  equ 0001h
RX1DTPPS_RX1DTPPS1_LENGTH                equ 0001h
RX1DTPPS_RX1DTPPS1_MASK                  equ 0002h
RX1DTPPS_RX1DTPPS2_POSN                  equ 0002h
RX1DTPPS_RX1DTPPS2_POSITION              equ 0002h
RX1DTPPS_RX1DTPPS2_SIZE                  equ 0001h
RX1DTPPS_RX1DTPPS2_LENGTH                equ 0001h
RX1DTPPS_RX1DTPPS2_MASK                  equ 0004h
RX1DTPPS_RX1DTPPS3_POSN                  equ 0003h
RX1DTPPS_RX1DTPPS3_POSITION              equ 0003h
RX1DTPPS_RX1DTPPS3_SIZE                  equ 0001h
RX1DTPPS_RX1DTPPS3_LENGTH                equ 0001h
RX1DTPPS_RX1DTPPS3_MASK                  equ 0008h
RX1DTPPS_RX1DTPPS4_POSN                  equ 0004h
RX1DTPPS_RX1DTPPS4_POSITION              equ 0004h
RX1DTPPS_RX1DTPPS4_SIZE                  equ 0001h
RX1DTPPS_RX1DTPPS4_LENGTH                equ 0001h
RX1DTPPS_RX1DTPPS4_MASK                  equ 0010h
RX1DTPPS_RX1DTPPS5_POSN                  equ 0005h
RX1DTPPS_RX1DTPPS5_POSITION              equ 0005h
RX1DTPPS_RX1DTPPS5_SIZE                  equ 0001h
RX1DTPPS_RX1DTPPS5_LENGTH                equ 0001h
RX1DTPPS_RX1DTPPS5_MASK                  equ 0020h

// Register: TX1CKPPS
#define TX1CKPPS TX1CKPPS
TX1CKPPS                                 equ 01ECCh
// bitfield definitions
TX1CKPPS_TX1CKPPS_POSN                   equ 0000h
TX1CKPPS_TX1CKPPS_POSITION               equ 0000h
TX1CKPPS_TX1CKPPS_SIZE                   equ 0006h
TX1CKPPS_TX1CKPPS_LENGTH                 equ 0006h
TX1CKPPS_TX1CKPPS_MASK                   equ 003Fh
TX1CKPPS_TX1CKPPS0_POSN                  equ 0000h
TX1CKPPS_TX1CKPPS0_POSITION              equ 0000h
TX1CKPPS_TX1CKPPS0_SIZE                  equ 0001h
TX1CKPPS_TX1CKPPS0_LENGTH                equ 0001h
TX1CKPPS_TX1CKPPS0_MASK                  equ 0001h
TX1CKPPS_TX1CKPPS1_POSN                  equ 0001h
TX1CKPPS_TX1CKPPS1_POSITION              equ 0001h
TX1CKPPS_TX1CKPPS1_SIZE                  equ 0001h
TX1CKPPS_TX1CKPPS1_LENGTH                equ 0001h
TX1CKPPS_TX1CKPPS1_MASK                  equ 0002h
TX1CKPPS_TX1CKPPS2_POSN                  equ 0002h
TX1CKPPS_TX1CKPPS2_POSITION              equ 0002h
TX1CKPPS_TX1CKPPS2_SIZE                  equ 0001h
TX1CKPPS_TX1CKPPS2_LENGTH                equ 0001h
TX1CKPPS_TX1CKPPS2_MASK                  equ 0004h
TX1CKPPS_TX1CKPPS3_POSN                  equ 0003h
TX1CKPPS_TX1CKPPS3_POSITION              equ 0003h
TX1CKPPS_TX1CKPPS3_SIZE                  equ 0001h
TX1CKPPS_TX1CKPPS3_LENGTH                equ 0001h
TX1CKPPS_TX1CKPPS3_MASK                  equ 0008h
TX1CKPPS_TX1CKPPS4_POSN                  equ 0004h
TX1CKPPS_TX1CKPPS4_POSITION              equ 0004h
TX1CKPPS_TX1CKPPS4_SIZE                  equ 0001h
TX1CKPPS_TX1CKPPS4_LENGTH                equ 0001h
TX1CKPPS_TX1CKPPS4_MASK                  equ 0010h
TX1CKPPS_TX1CKPPS5_POSN                  equ 0005h
TX1CKPPS_TX1CKPPS5_POSITION              equ 0005h
TX1CKPPS_TX1CKPPS5_SIZE                  equ 0001h
TX1CKPPS_TX1CKPPS5_LENGTH                equ 0001h
TX1CKPPS_TX1CKPPS5_MASK                  equ 0020h

// Register: RX2DTPPS
#define RX2DTPPS RX2DTPPS
RX2DTPPS                                 equ 01ECDh
// bitfield definitions
RX2DTPPS_RX2DTPPS_POSN                   equ 0000h
RX2DTPPS_RX2DTPPS_POSITION               equ 0000h
RX2DTPPS_RX2DTPPS_SIZE                   equ 0006h
RX2DTPPS_RX2DTPPS_LENGTH                 equ 0006h
RX2DTPPS_RX2DTPPS_MASK                   equ 003Fh
RX2DTPPS_RX2DTPPS0_POSN                  equ 0000h
RX2DTPPS_RX2DTPPS0_POSITION              equ 0000h
RX2DTPPS_RX2DTPPS0_SIZE                  equ 0001h
RX2DTPPS_RX2DTPPS0_LENGTH                equ 0001h
RX2DTPPS_RX2DTPPS0_MASK                  equ 0001h
RX2DTPPS_RX2DTPPS1_POSN                  equ 0001h
RX2DTPPS_RX2DTPPS1_POSITION              equ 0001h
RX2DTPPS_RX2DTPPS1_SIZE                  equ 0001h
RX2DTPPS_RX2DTPPS1_LENGTH                equ 0001h
RX2DTPPS_RX2DTPPS1_MASK                  equ 0002h
RX2DTPPS_RX2DTPPS2_POSN                  equ 0002h
RX2DTPPS_RX2DTPPS2_POSITION              equ 0002h
RX2DTPPS_RX2DTPPS2_SIZE                  equ 0001h
RX2DTPPS_RX2DTPPS2_LENGTH                equ 0001h
RX2DTPPS_RX2DTPPS2_MASK                  equ 0004h
RX2DTPPS_RX2DTPPS3_POSN                  equ 0003h
RX2DTPPS_RX2DTPPS3_POSITION              equ 0003h
RX2DTPPS_RX2DTPPS3_SIZE                  equ 0001h
RX2DTPPS_RX2DTPPS3_LENGTH                equ 0001h
RX2DTPPS_RX2DTPPS3_MASK                  equ 0008h
RX2DTPPS_RX2DTPPS4_POSN                  equ 0004h
RX2DTPPS_RX2DTPPS4_POSITION              equ 0004h
RX2DTPPS_RX2DTPPS4_SIZE                  equ 0001h
RX2DTPPS_RX2DTPPS4_LENGTH                equ 0001h
RX2DTPPS_RX2DTPPS4_MASK                  equ 0010h
RX2DTPPS_RX2DTPPS5_POSN                  equ 0005h
RX2DTPPS_RX2DTPPS5_POSITION              equ 0005h
RX2DTPPS_RX2DTPPS5_SIZE                  equ 0001h
RX2DTPPS_RX2DTPPS5_LENGTH                equ 0001h
RX2DTPPS_RX2DTPPS5_MASK                  equ 0020h

// Register: TX2CKPPS
#define TX2CKPPS TX2CKPPS
TX2CKPPS                                 equ 01ECEh
// bitfield definitions
TX2CKPPS_TX2CKPPS_POSN                   equ 0000h
TX2CKPPS_TX2CKPPS_POSITION               equ 0000h
TX2CKPPS_TX2CKPPS_SIZE                   equ 0006h
TX2CKPPS_TX2CKPPS_LENGTH                 equ 0006h
TX2CKPPS_TX2CKPPS_MASK                   equ 003Fh
TX2CKPPS_TX2CKPPS0_POSN                  equ 0000h
TX2CKPPS_TX2CKPPS0_POSITION              equ 0000h
TX2CKPPS_TX2CKPPS0_SIZE                  equ 0001h
TX2CKPPS_TX2CKPPS0_LENGTH                equ 0001h
TX2CKPPS_TX2CKPPS0_MASK                  equ 0001h
TX2CKPPS_TX2CKPPS1_POSN                  equ 0001h
TX2CKPPS_TX2CKPPS1_POSITION              equ 0001h
TX2CKPPS_TX2CKPPS1_SIZE                  equ 0001h
TX2CKPPS_TX2CKPPS1_LENGTH                equ 0001h
TX2CKPPS_TX2CKPPS1_MASK                  equ 0002h
TX2CKPPS_TX2CKPPS2_POSN                  equ 0002h
TX2CKPPS_TX2CKPPS2_POSITION              equ 0002h
TX2CKPPS_TX2CKPPS2_SIZE                  equ 0001h
TX2CKPPS_TX2CKPPS2_LENGTH                equ 0001h
TX2CKPPS_TX2CKPPS2_MASK                  equ 0004h
TX2CKPPS_TX2CKPPS3_POSN                  equ 0003h
TX2CKPPS_TX2CKPPS3_POSITION              equ 0003h
TX2CKPPS_TX2CKPPS3_SIZE                  equ 0001h
TX2CKPPS_TX2CKPPS3_LENGTH                equ 0001h
TX2CKPPS_TX2CKPPS3_MASK                  equ 0008h
TX2CKPPS_TX2CKPPS4_POSN                  equ 0004h
TX2CKPPS_TX2CKPPS4_POSITION              equ 0004h
TX2CKPPS_TX2CKPPS4_SIZE                  equ 0001h
TX2CKPPS_TX2CKPPS4_LENGTH                equ 0001h
TX2CKPPS_TX2CKPPS4_MASK                  equ 0010h
TX2CKPPS_TX2CKPPS5_POSN                  equ 0005h
TX2CKPPS_TX2CKPPS5_POSITION              equ 0005h
TX2CKPPS_TX2CKPPS5_SIZE                  equ 0001h
TX2CKPPS_TX2CKPPS5_LENGTH                equ 0001h
TX2CKPPS_TX2CKPPS5_MASK                  equ 0020h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 01F10h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 01F11h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 01F12h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h

